tutorials/cases/prescribedUsCases/shear/constant/reactions
species
(
    N2
);

reactions
{
}
