tutorials/cases/prescribedUsCases/shear/0.orig/Df
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      Df;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Darcy drag tensor: large, so the gas stays essentially quiescent and the
// only motion of the solid species is the prescribed Us advection.
dimensions      [0 -2 0 0 0 0 0];

internalField   uniform (1e+09 0 0 0 1e+09 0 0 0 1e+09);

boundaryField
{
    "(left|right|bottom|top)"
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
